<header style="padding:1px;background:#f9f9f9;border-top:3px solid #00b2b1"><img id="Teradata-logo" src="https://www.teradata.com/Teradata/Images/Rebrand/Teradata_logo-two_color.png" alt="Teradata" width="220" align="right" />

<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Array functions in teradataml.</b>
</header>

### Disclaimer
TERADATA DISCLAIMS ALL WARRANTIES RELATING TO THE CODE, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES AGAINST INFRINGEMENT OF THIRD-PARTY RIGHTS, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.

TERADATA SHALL NOT BE RESPONSIBLE OR LIABLE WITH RESPECT TO ANY SUBJECT MATTER OF THE CODE UNDER ANY CONTRACT, NEGLIGENCE, STRICT LIABILITY OR OTHER THEORY 
    (A) FOR LOSS OR INACCURACY OF DATA OR COST OF PROCUREMENT OF SUBSTITUTE GOODS, SERVICES OR TECHNOLOGY, OR 
    (B) FOR ANY INDIRECT, INCIDENTAL OR CONSEQUENTIAL DAMAGES INCLUDING, BUT NOT LIMITED TO LOSS OF REVENUES AND LOSS OF PROFITS. TERADATA SHALL NOT BE RESPONSIBLE FOR ANY MATTER BEYOND ITS REASONABLE CONTROL.

Notwithstanding anything to the contrary: 
    (a) Teradata will have no obligation of any kind with respect to any Code-related comments, suggestions, design changes or improvements that you elect to provide to Teradata in either verbal or written form (collectively, “Feedback”), and 
    (b) Teradata and its affiliates are hereby free to use any ideas, concepts, know-how or techniques, in whole or in part, contained in Feedback: 
        (i) for any purpose whatsoever, including developing, manufacturing, and/or marketing products and/or services incorporating Feedback in whole or in part, and 
        (ii) without any restrictions or limitations, including requiring the payment of any license fees, royalties, or other consideration.

<html lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
</head><body>

<br>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>List of available Array functions in teradataml.</b>
 <ul style="list-style-type:disc;">
 <li><h2>teradataml: Array</h2>
  <ul>
   <li><h3>array()</h3> Creates an object of Array.</li>
  </ul>
 </li>
 <li><h2>teradataml: DataFrame</h2>
  <ul>
   <li><h3>DataFrame.unnest()</h3> Explodes an array column into multiple rows.</li>
  </ul>
 </li>
 <li><h2>teradataml: DataFrameColumn (ColumnExpression) – Array Operations</h2>
  <ul>
   <li><h2>Comparisons</h2>
    <ul>
     <li><h3>DataFrameColumn.array_gt()</h3> Checks if array elements are greater than another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_ge()</h3> Checks if array elements are greater than or equal to another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_lt()</h3> Checks if array elements are less than another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_le()</h3> Checks if array elements are less than or equal to another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_eq()</h3> Checks if array elements are equal to another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_ne()</h3> Checks if array elements are not equal to another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_compare()</h3> Compares the elements of the array with another array.</li>
    </ul>
   </li>
   <li><h2>Arithmetic Operations</h2>
    <ul>
     <li><h3>DataFrameColumn.array_add()</h3> Element-wise addition with another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_sub()</h3> Element-wise subtraction with another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_mul()</h3> Element-wise multiplication with another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_mod()</h3> Element-wise modulus with another array or a scalar value.</li>
     <li><h3>DataFrameColumn.array_div()</h3> Element-wise division with another array or a scalar value.</li>
    </ul>
   </li>
   <li><h2>Aggregations</h2>
    <ul>
     <li><h3>DataFrameColumn.array_sum()</h3> Computes the sum of array elements.</li>
     <li><h3>DataFrameColumn.array_avg()</h3> Computes the average of array elements.</li>
     <li><h3>DataFrameColumn.array_max()</h3> Returns the maximum value in the array.</li>
     <li><h3>DataFrameColumn.array_min()</h3> Returns the minimum value in the array.</li>
     <li><h3>DataFrameColumn.array_count_distinct()</h3> Counts distinct elements in the array.</li>
     <li><h3>DataFrameColumn.array_agg()</h3> Aggregates the rows of a column into an array.</li>
    </ul>
   </li>
   <li><h2>Array Updates & Transformations</h2>
    <ul>
     <li><h3>DataFrameColumn.array_update()</h3> Updates the element at a specific index or a range.</li>
     <li><h3>DataFrameColumn.array_concat()</h3> Concatenates two arrays into a single array.</li>
     <li><h3>DataFrameColumn.array_append()</h3> Appends an element to the end of an array.</li>
     <li><h3>DataFrameColumn.array_prepend()</h3> Prepends an element to the beginning of an array.</li>
     <li><h3>DataFrameColumn.array_contains()</h3> Checks if an array contains a specific element.</li>
     <li><h3>DataFrameColumn.array_insert()</h3> Inserts an element at a specific index.</li>
     <li><h3>DataFrameColumn.array_remove()</h3> Removes all occurrences of a specified element.</li>
     <li><h3>DataFrameColumn.array_trim()</h3> Trims elements from the end of the array.</li>
     <li><h3>DataFrameColumn.array_sort()</h3> Sorts the elements of an array.</li>
     <li><h3>DataFrameColumn.array_join()</h3> Joins array elements into a delimited string.</li>
     <li><h3>DataFrameColumn.array_distinct()</h3> Removes duplicate elements from an array.</li>
     <li><h3>DataFrameColumn.array_compact()</h3> Removes null elements from an array.</li>
     <li><h3>DataFrameColumn.array_reverse()</h3> Reverses the order of elements in an array.</li>
     <li><h3>DataFrameColumn.array_repeat()</h3> Creates an array by repeating a value a specified number of times.</li>
     <li><h3>DataFrameColumn.extend()</h3> Extends the space for new elements in an array.</li>
    </ul>
   </li>
   <li><h2>Array Set Operations</h2>
    <ul>
     <li><h3>DataFrameColumn.array_overlap()</h3> Checks if two arrays have any common elements.</li>
     <li><h3>DataFrameColumn.array_intersect()</h3> Returns the intersection of two arrays.</li>
     <li><h3>DataFrameColumn.array_union()</h3> Returns the union of two arrays with distinct elements.</li>
     <li><h3>DataFrameColumn.array_except()</h3> Returns the elements of the first array that are not in the second array.</li>
    </ul>
   </li>
   <li><h2>Indexing & Position</h2>
    <ul>
     <li><h3>DataFrameColumn.get()</h3> Gets the element at a specific index in an array.</li>
     <li><h3>DataFrameColumn.element_state()</h3> Checks if the element at a specific index in an array is initialized or uninitialized.</li>
     <li><h3>DataFrameColumn.array_position()</h3> Gets the position of an element in the array.</li>
     <li><h3>DataFrameColumn.slice()</h3> Returns the subset of an array based on specified start index and length.</li>
     <li><h3>DataFrameColumn.shuffle()</h3> Shuffles the elements of the array randomly.</li>
    </ul>
   </li>
   <li><h2>Array Properties</h2>
    <ul>
     <li><h3>DataFrameColumn.array_size()</h3> Returns the size of an array.</li>
     <li><h3>DataFrameColumn.total_initialized_elements()</h3> Returns the number of initialized elements in an array.</li>
     <li><h3>DataFrameColumn.limit()</h3> Returns the highest possible index in the array.</li>
     <li><h3>DataFrameColumn.first_index()</h3> Returns the lowest index in the array.</li>
     <li><h3>DataFrameColumn.last_index()</h3> Returns the highest index in the array.</li>
     <li><h3>DataFrameColumn.prior()</h3> Returns the index preceding a given index in the array.</li>
     <li><h3>DataFrameColumn.next()</h3> Returns the index following a given index in the array.</li>
    </ul>
   </li>
  </ul>
 </li>
  <li><h2>teradataml: Functions</h2>
    <ul>
        <li><h3>sequence</h3> Generates an array of numbers from start to stop with given step.</li>
    </ul>
  </li>
</ul><br>
</body>
</html>

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Import libraries and create connection.</b>

In [1]:
%load_ext autoreload
%autoreload 2
import sys
sys.path.append(r"C:\Users\ks255132\git_repos\pyTeradata")
sys.path.append(r"C:\Users\ks255132\git_repos\PyTeradataSpark")
sys.path.append(r"C:\Users\ks255132\git_repos\teradatasqlalchemy")

In [2]:
import getpass
from teradataml import *

# Get the connection to the Vantage using create_context()
td_context = create_context(host=getpass.getpass("Hostname: "), username=getpass.getpass("Username: "), password=getpass.getpass("Password: "))

load_example_data("array", "array_table")
load_example_data("dataframe", "admissions_train")

# Create a DataFrame on 'array_table'.
df_arrays = DataFrame("array_table")
tdf = DataFrame("admissions_train")

Hostname:  ········
Username:  ········
Password:  ········

WARNING: Skipped loading table array_table since it already exists in the database.

WARNING: Skipped loading table array_table since it already exists in the database.

WARNING: Skipped loading table array_table since it already exists in the database.

In [3]:
from IPython.display import display
def print_variables(df):
    print(" ************************* DataFrame ********************* ")
    display(df)
    print("\n\n")
    print(" ************************* DataFrame.tdtypes ********************* ")
    display(df.tdtypes)
    print("\n\n")

In [4]:
print_variables(df_arrays)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)

In [5]:
print_variables(tdf)

 ************************* DataFrame *********************

   masters   gpa     stats programming  admitted
id
26     yes  3.57  Advanced    Advanced         1
40     yes  3.95    Novice    Beginner         0
7      yes  2.33    Novice      Novice         1
17      no  3.83  Advanced    Advanced         1
6      yes  3.50  Beginner    Advanced         1
36      no  3.00  Advanced      Novice         0
28      no  3.93  Advanced    Advanced         1
19     yes  1.98  Advanced    Advanced         0
30     yes  3.79  Advanced      Novice         0
15     yes  4.00  Advanced    Advanced         1

 ************************* DataFrame.tdtypes *********************

id                                       INTEGER()
masters         VARCHAR(length=5, charset='LATIN')
gpa                                        FLOAT()
stats          VARCHAR(length=30, charset='LATIN')
programming    VARCHAR(length=30, charset='LATIN')
admitted                                 INTEGER()

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Array</b>

In [6]:
# Create an Array object with integer values and assign it to a new column.
from teradataml.dataframe.array import Array
from teradatasqlalchemy.types import ARRAY_INTEGER

arr_obj = Array((1, 2, 3, 4, 5), ARRAY_INTEGER('[5]'))
df = df_arrays.assign(new_array = arr_obj)
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3    new_array
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  (1,2,3,4,5)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (1,2,3,4,5)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (1,2,3,4,5)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (1,2,3,4,5)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (1,2,3,4,5)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (1,2,3,4,5)

 ************************* DataFrame.tdtypes *********************

id                                   INTEGER()
arr1                   ARRAY_INTEGER('[1:10]')
arr2                   ARRAY_INTEGER('[1:10]')
arr3         ARRAY_VARCHAR('[1:10]', length=4)
new_array                 ARRAY_INTEGER('[5]')

In [7]:
# Create an Array object with VARCHAR values.
from teradatasqlalchemy.types import ARRAY_VARCHAR

arr_varchar = Array(('hello', 'world', 'test'), ARRAY_VARCHAR('[3]'))
df = df_arrays.assign(string_array = arr_varchar)
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3              string_array
id
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  ('hello','world','test')
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  ('hello','world','test')
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  ('hello','world','test')
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  ('hello','world','test')
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  ('hello','world','test')
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  ('hello','world','test')

 ************************* DataFrame.tdtypes *********************

id                                      INTEGER()
arr1                      ARRAY_INTEGER('[1:10]')
arr2                      ARRAY_INTEGER('[1:10]')
arr3            ARRAY_VARCHAR('[1:10]', length=4)
string_array                 ARRAY_VARCHAR('[3]')

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>DataFrame</b>

### DataFrame.unnest() Method

In [8]:
# Explode the array column 'arr1' without key column and ordinality.
res = df_arrays.unnest(array_col="arr1")
print_variables(res)

 ************************* DataFrame *********************

   id               arr1                   arr2                        arr3  key_col  array_col
0   5   (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')        1         34
1   5   (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')        1         54
2   2  (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        2        150
3   2  (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        2         25
4   2  (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        2         45
5   2  (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        2         55
6   2  (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        2         35
7   5   (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')        1         44
8   5   (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')        1         24
9   5   (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')        1         14

 ************************* DataFrame.tdtypes *********************

id                                   INTEGER()
arr1                   ARRAY_INTEGER('[1:10]')
arr2                   ARRAY_INTEGER('[1:10]')
arr3         ARRAY_VARCHAR('[1:10]', length=4)
key_col                              INTEGER()
array_col                            INTEGER()

In [9]:
# Explode the array column 'arr3' with key column 'id' and ordinality.
df = df_arrays.unnest(array_col=df_arrays.arr3, key_col="id", ordinality=True)
print_variables(df)

 ************************* DataFrame *********************

   id               arr1                   arr2                        arr3  key_col array_col  pos_col
0   5   (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')        5      None        3
1   5   (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')        5        lm        5
2   1   (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')        1        ab        1
3   1   (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')        1        bc        2
4   1   (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')        1        ab        4
5   1   (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')        1        ef        5
6   4  (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')        4        mn        1
7   4  (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')        4        no        2
8   4  (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')        4      None        3
9   4  (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')        4        op        4

 ************************* DataFrame.tdtypes *********************

id                                    INTEGER()
arr1                    ARRAY_INTEGER('[1:10]')
arr2                    ARRAY_INTEGER('[1:10]')
arr3          ARRAY_VARCHAR('[1:10]', length=4)
key_col                               INTEGER()
array_col    VARCHAR(length=4, charset='LATIN')
pos_col                               INTEGER()

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>DataFrameColumn (ColumnExpression) – Array Operations</b>

<hr>
<b style = 'font-size:26px;font-family:Arial;color:#E37C4D'>Comparisons</b>

### DataFrameColumn.array_gt()

In [10]:
# Checks if array elements are greater than the corresponding elements of another array.
df = df_arrays.assign(res = df_arrays.arr1.array_gt(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        (1,0,0,0,1)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')        (0,1,0,0,1)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (1,NULL,NULL,0,1)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')        (0,0,1,0,1)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')        (0,0,0,0,1)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (0,NULL,NULL,0,1)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_ge()

In [11]:
# Checks if array elements are greater than or equal to the corresponding elements of another array.
df = df_arrays.assign(res = df_arrays.arr1.array_ge(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        (1,0,0,0,1)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (1,NULL,NULL,0,1)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')        (0,1,0,1,1)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')        (0,1,1,0,1)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')        (0,0,0,1,1)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (0,NULL,NULL,0,1)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_lt()

In [12]:
# Checks if array elements are less than a scalar value.
df = df_arrays.assign(res = df_arrays.arr1.array_lt(50))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3          res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (0,1,1,1,0)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (1,1,0,1,0)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (1,0,1,1,0)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (0,1,1,1,0)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  (1,1,1,1,0)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (1,1,1,1,0)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_le()

In [13]:
# Checks if array elements are less than or equal to a scalar value.
df = df_arrays.assign(res = df_arrays.arr1.array_le(25))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3          res
id
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (1,1,0,0,0)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (0,1,0,0,0)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (1,1,0,0,0)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  (1,1,0,0,0)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (1,0,0,0,0)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (0,0,0,0,0)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_eq()

In [14]:
# Checks if array elements are equal to the corresponding elements of another array.
df = df_arrays.assign(res = df_arrays.arr1.array_eq(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        (0,0,0,0,0)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')        (0,1,0,0,0)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')        (0,0,0,1,0)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (0,NULL,NULL,0,0)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')        (0,0,0,1,0)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (0,NULL,NULL,0,0)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_ne()

In [15]:
# Checks if array elements are not equal to the corresponding elements of another array.
df = df_arrays.assign(res = df_arrays.arr1.array_ne(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')        (1,1,1,1,1)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')        (1,0,1,1,1)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')        (1,1,1,0,1)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (1,NULL,NULL,1,1)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')        (1,1,1,0,1)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (1,NULL,NULL,1,1)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_compare()

In [16]:
# Compares the elements of the array with another array.
df = df_arrays.assign(res = df_arrays.arr1.array_compare(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    0
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    0
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    0
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    0
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    0
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    0

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             BYTEINT()

<hr>
<b style = 'font-size:26px;font-family:Arial;color:#E37C4D'>Arithmetic Operations</b>

### DataFrameColumn.array_add()

In [17]:
# Adds a scalar value to array elements.
df = df_arrays.assign(res = df_arrays.arr1.array_add(5))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (155,30,40,50,60)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (185,33,43,53,63)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (17,27,325,47,57)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (21,266,41,51,61)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (15,25,35,45,55)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (19,29,39,49,59)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_sub()

In [18]:
# Subtracts elements of one array from another array.
df = df_arrays.assign(res = df_arrays.arr1.array_sub(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                      res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')     (122,-25,-60,-45,29)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')      (-13,0,180,-158,29)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')       (-13,91,-124,0,31)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (150,NULL,NULL,-202,31)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')     (-13,-180,-185,0,29)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (-12,NULL,NULL,-136,30)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_mul()

In [19]:
# Multiplies elements of the array by the scalar value.
df = df_arrays.assign(res = df_arrays.arr1.array_mul(3))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                   res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (450,75,105,135,165)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (48,783,108,138,168)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')   (36,66,960,126,156)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (540,84,114,144,174)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    (30,60,90,120,150)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (42,72,102,132,162)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_mod()

In [20]:
# Computes modulo of elements present in second position to fourth position in the array.
df = df_arrays.assign(res = df_arrays.arr1.array_mod(df.arr1, lower_bound=2, upper_bound=4))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (NULL,0,0,0,NULL)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  (NULL,0,0,0,NULL)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (NULL,0,0,0,NULL)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (NULL,0,0,0,NULL)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (NULL,0,0,0,NULL)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (NULL,0,0,0,NULL)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_div()

In [21]:
# Divides array elements by a scalar value.
df = df_arrays.assign(res = df_arrays.arr1.array_div(2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3               res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (75,12,18,22,28)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (6,11,160,21,26)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (8,130,18,23,28)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (90,14,19,24,29)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (5,10,15,20,25)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (7,12,17,22,27)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

<hr>
<b style = 'font-size:26px;font-family:Arial;color:#E37C4D'>Aggregations</b>

### DataFrameColumn.array_sum()

In [22]:
# Computes the sum of all the elements in an array within specified bounds.
df = df_arrays.assign(res = df_arrays.arr1.array_sum(lower_bound=1, upper_bound=4))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3    res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  255.0
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  359.0
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  396.0
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  294.0
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  100.0
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  116.0

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                              NUMBER()

### DataFrameColumn.array_avg()

In [23]:
# Computes the average of elements in an array within specified bounds.
df = df_arrays.assign(res = df_arrays.arr1.array_avg(lower_bound=1, upper_bound=3))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3         res
id
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   24.000000
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')   70.000000
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  118.000000
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   20.000000
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  104.333333
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')   82.000000

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                               FLOAT()

### DataFrameColumn.array_max()

In [24]:
# Gets the maximum value from the array within specified bounds.
df = df_arrays.assign(res = df_arrays.arr1.array_max(lower_bound=1, upper_bound=4))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   44
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  150
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  320
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   40
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  261
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  180

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.array_min()

In [25]:
# Gets the minimum value from the array.
df = df_arrays.assign(res = df_arrays.arr1.array_min())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')   25
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')   12
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')   16
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')   28
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   10
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   14

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.array_count_distinct()

In [26]:
# Counts the number of distinct elements in an array within specified bounds.
df = df_arrays.assign(res = df_arrays.arr1.array_count_distinct(lower_bound=1, upper_bound=3))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    3
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    3
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    3
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    3
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    3
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    3

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.array_agg()

In [27]:
# Aggregates the rows of a column into an array.
df = tdf.groupby("programming").assign(id_array=tdf.id.array_agg())
print_variables(df)

 ************************* DataFrame *********************

  programming                                        id_array
0      Novice                 (7,37,4,24,23,12,30,13,33,36,5)
1    Beginner           (40,22,35,32,39,38,29,21,34,3,31,1,2)
2    Advanced  (27,15,16,10,19,14,17,11,9,28,26,20,18,8,25,6)

 ************************* DataFrame.tdtypes *********************

programming    VARCHAR(length=30, charset='LATIN')
id_array                    ARRAY_INTEGER('[100]')

<hr>
<b style = 'font-size:26px;font-family:Arial;color:#E37C4D'>Array Updates & Transformations</b>

### DataFrameColumn.array_update()

In [28]:
# Updates the element at a specific index or subset of elements in an array with a new value.
df = df_arrays.assign(res = df_arrays.arr1.array_update(100, lower_bound=2, upper_bound=4))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                   res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (10,100,100,100,50)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,100,100,100,58)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')   (12,100,100,100,52)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (150,100,100,100,55)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (14,100,100,100,54)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')   (16,100,100,100,56)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_concat()

In [29]:
# Concatenates two arrays into a single array.
df = df_arrays.assign(res = df_arrays.arr1.array_concat(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                                    res
id
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')     (12,22,320,42,52,25,22,140,200,23)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')      (10,20,30,40,50,23,200,215,40,21)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')       (150,25,35,45,55,28,50,95,90,26)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (14,24,34,44,54,26,NULL,NULL,180,24)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')     (16,261,36,46,56,29,170,160,46,25)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,28,38,48,58,30,NULL,NULL,250,27)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_append()

In [30]:
# Appends an element to the end of an array.
df = df_arrays.assign(res = df_arrays.arr1.array_append(99))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                   res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (150,25,35,45,55,99)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (12,22,320,42,52,99)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,28,38,48,58,99)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (16,261,36,46,56,99)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (10,20,30,40,50,99)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (14,24,34,44,54,99)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_prepend()

In [31]:
# Prepends an element to the beginning of an array.
df = df_arrays.assign(res = df_arrays.arr1.array_prepend(0))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                  res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (0,150,25,35,45,55)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (0,180,28,38,48,58)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (0,12,22,320,42,52)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (0,16,261,36,46,56)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (0,10,20,30,40,50)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (0,14,24,34,44,54)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_contains()

In [32]:
# Checks if an array contains a specific element.
df = df_arrays.assign(res = df_arrays.arr1.array_contains(10))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    1
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    0
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    0
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    0
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    0
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    0

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             BYTEINT()

### DataFrameColumn.array_insert()

In [33]:
# Inserts an element at a specific index in an array.
df = df_arrays.assign(res = df_arrays.arr1.array_insert(1, 99))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                   res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (99,10,20,30,40,50)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (99,12,22,320,42,52)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (99,180,28,38,48,58)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (99,150,25,35,45,55)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (99,14,24,34,44,54)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (99,16,261,36,46,56)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_remove()

In [34]:
# Removes all occurrences of a specified element from an array.
df = df_arrays.assign(res = df_arrays.arr1.array_remove(10))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (16,261,36,46,56)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')      (20,30,40,50)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (150,25,35,45,55)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (14,24,34,44,54)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (12,22,320,42,52)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,28,38,48,58)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_trim()

In [35]:
# Trims elements from the end of the array.
df = df_arrays.assign(res = df_arrays.arr1.array_trim(1))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3             res
id
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (12,22,320,42)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (10,20,30,40)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (150,25,35,45)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (14,24,34,44)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,28,38,48)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (16,261,36,46)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_sort()

In [36]:
# Sorts the elements of an array in descending order with NULLs last.
df = df_arrays.assign(res = df_arrays.arr1.array_sort(elements_order='DESC', nulls_order='LAST'))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (150,55,45,35,25)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,58,48,38,28)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (261,56,46,36,16)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (320,52,42,22,12)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (50,40,30,20,10)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (54,44,34,24,14)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_join()

In [37]:
# Joins the elements of an array into a single string with a semicolon delimiter.
df = df_arrays.assign(res = df_arrays.arr1.array_join(';'))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3              res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  150;25;35;45;55
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  12;22;320;42;52
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  16;261;36;46;56
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  180;28;38;48;58
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   10;20;30;40;50
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   14;24;34;44;54

 ************************* DataFrame.tdtypes *********************

id                                  INTEGER()
arr1                  ARRAY_INTEGER('[1:10]')
arr2                  ARRAY_INTEGER('[1:10]')
arr3        ARRAY_VARCHAR('[1:10]', length=4)
res     VARCHAR(length=1024, charset='LATIN')

### DataFrameColumn.array_distinct()

In [38]:
# Removes duplicate elements from an array.
df = df_arrays.assign(res = df_arrays.arr3.array_distinct())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                         res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')       ('xy','yz','za','ab')
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  ('mn','no',NULL,'op','pq')
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')       ('pq','ab','st','tu')
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')       ('uv','xy','ab','yz')
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')       ('ab','bc','cd','ef')
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  ('ij','jk',NULL,'kl','lm')

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res     ARRAY_VARCHAR('[1:10]', length=4)

### DataFrameColumn.array_compact()

In [39]:
# Removes null elements from an array.
df = df_arrays.assign(res = df_arrays.arr2.array_compact())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                 res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  (23,200,215,40,21)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (29,170,160,46,25)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (25,22,140,200,23)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    (28,50,95,90,26)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')         (26,180,24)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')         (30,250,27)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_reverse()

In [40]:
# Reverses the order of elements in an array.
df = df_arrays.assign(res = df_arrays.arr1.array_reverse())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (55,45,35,25,150)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (58,48,38,28,180)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (56,46,36,261,16)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (52,42,320,22,12)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (50,40,30,20,10)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (54,44,34,24,14)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_repeat()

In [41]:
# Creates an array by repeating a value a specified number of times.
df = df_arrays.assign(res = df_arrays.id.array_repeat(3))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3      res
id
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (5,5,5)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (2,2,2)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (6,6,6)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  (1,1,1)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (3,3,3)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (4,4,4)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                ARRAY_INTEGER('[100]')

### DataFrameColumn.extend()

In [42]:
# Extends the space for one or more new elements in an array.
df = df_arrays.assign(res = df_arrays.arr1.extend(2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                          res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (10,20,30,40,50,NULL,NULL)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (12,22,320,42,52,NULL,NULL)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (16,261,36,46,56,NULL,NULL)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (150,25,35,45,55,NULL,NULL)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (14,24,34,44,54,NULL,NULL)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,28,38,48,58,NULL,NULL)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Array Set Operations</b>

### DataFrameColumn.array_overlap()

In [43]:
# Checks if two arrays have any elements in common.
df = df_arrays.assign(res = df_arrays.arr1.array_overlap(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  0.0
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  1.0
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  NaN
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  1.0
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  1.0
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  1.0

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             BYTEINT()

### DataFrameColumn.array_intersect()

In [44]:
# Returns the intersection of two arrays.
df = df_arrays.assign(res = df_arrays.arr1.array_intersect(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3   res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')  (40)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    ()
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (22)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    ()
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')  (24)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (46)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_union()

In [45]:
# Returns the union of two arrays with distinct elements.
df = df_arrays.assign(res = df_arrays.arr1.array_union(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                               res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (150,25,35,45,55,28,50,95,90,26)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,28,38,48,58,30,NULL,250,27)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')   (12,22,320,42,52,25,140,200,23)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')   (16,261,36,46,56,29,170,160,25)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    (10,20,30,40,50,23,200,215,21)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')      (14,24,34,44,54,26,NULL,180)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.array_except()

In [46]:
# Returns the elements of the first array that are not in the second array.
df = df_arrays.assign(res = df_arrays.arr1.array_except(df_arrays.arr2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')     (16,261,36,56)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')      (10,20,30,50)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (150,25,35,45,55)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')      (14,34,44,54)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')     (12,320,42,52)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (180,28,38,48,58)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Indexing & Position</b>

### DataFrameColumn.get()

In [47]:
# Gets the element at a specific index in an array.
df = df_arrays.assign(res = df_arrays.arr1.get(1))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   10
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')   16
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')   12
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  150
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   14
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  180

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.element_state()

In [48]:
# Checks if the element at a specific index in an array is initialized or uninitialized.
df = df_arrays.assign(res = df_arrays.arr1.element_state(1))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    1
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    1
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    1
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    1
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    1
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    1

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.array_position()

In [49]:
# Gets the position of an element in the array.
df = df_arrays.assign(res = df_arrays.arr1.array_position(10))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    0
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    0
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    0
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    1
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    0
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    0

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.slice()

In [50]:
# Gets a subset of the array starting from index 2 with length 3.
df = df_arrays.assign(res = df_arrays.arr1.slice(2, 3))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3          res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')   (25,35,45)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')   (28,38,48)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (22,320,42)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (261,36,46)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (20,30,40)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (24,34,44)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

### DataFrameColumn.shuffle()

In [51]:
# Shuffles the elements of the array randomly.
df = df_arrays.assign(res = df_arrays.arr1.shuffle())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3                res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   (10,20,30,40,50)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')  (12,320,42,22,52)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')  (56,46,16,261,36)
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')  (35,55,150,45,25)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   (14,44,34,24,54)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')  (28,180,38,58,48)

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res               ARRAY_INTEGER('[1:10]')

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Array Properties</b>

### DataFrameColumn.array_size()

In [52]:
# Gets the size of an array.
df = df_arrays.assign(res = df_arrays.arr1.array_size())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    5
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    5
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    5
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    5
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    5
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    5

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.total_initialized_elements()

In [53]:
# Gets the total number of initialized elements in an array.
df = df_arrays.assign(res = df_arrays.arr1.total_initialized_elements())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    5
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    5
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    5
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    5
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    5
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    5

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.limit()

In [54]:
# Gets the highest possible subscript value in the array.
df = df_arrays.assign(res = df_arrays.arr1.limit())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')   10
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')   10
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')   10
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')   10
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')   10
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')   10

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.first_index()

In [55]:
# Gets the lowest subscript value in the array.
df = df_arrays.assign(res = df_arrays.arr1.first_index())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    1
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    1
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    1
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    1
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    1
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    1

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.last_index()

In [56]:
# Gets the highest subscript value in the array.
df = df_arrays.assign(res = df_arrays.arr1.last_index())
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    5
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    5
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    5
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    5
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    5
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    5

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.prior()

In [57]:
# Gets the subscript of the element prior to the element specified for the array.
df = df_arrays.assign(res = df_arrays.arr1.prior(2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    1
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    1
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    1
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    1
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    1
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    1

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

### DataFrameColumn.next()

In [58]:
# Gets the subscript of the element next to the element specified for the array.
df = df_arrays.assign(res = df_arrays.arr1.next(2))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  res
id
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')    3
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')    3
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')    3
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')    3
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')    3
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')    3

 ************************* DataFrame.tdtypes *********************

id                              INTEGER()
arr1              ARRAY_INTEGER('[1:10]')
arr2              ARRAY_INTEGER('[1:10]')
arr3    ARRAY_VARCHAR('[1:10]', length=4)
res                             INTEGER()

<hr>
<b style = 'font-size:28px;font-family:Arial;color:#E37C4D'>Functions</b>

### sequence() Function

In [59]:
# Generate an array of numbers sequence in columns.
from teradataml.dataframe.functions import sequence

df = df_arrays.assign(start_col = 4, stop_col = -6, step_col = -3)
df = df.assign(arr_seq = sequence(df.start_col, df.stop_col, df.step_col))
print_variables(df)

 ************************* DataFrame *********************

                 arr1                   arr2                        arr3  start_col  step_col  stop_col      arr_seq
id
2   (150,25,35,45,55)       (28,50,95,90,26)  ('xy','yz','za','ab','xy')          4        -3        -6  (4,1,-2,-5)
6   (16,261,36,46,56)     (29,170,160,46,25)  ('uv','xy','ab','xy','yz')          4        -3        -6  (4,1,-2,-5)
4   (180,28,38,48,58)  (30,NULL,NULL,250,27)  ('mn','no',NULL,'op','pq')          4        -3        -6  (4,1,-2,-5)
3   (12,22,320,42,52)     (25,22,140,200,23)  ('pq','ab','ab','st','tu')          4        -3        -6  (4,1,-2,-5)
1    (10,20,30,40,50)     (23,200,215,40,21)  ('ab','bc','cd','ab','ef')          4        -3        -6  (4,1,-2,-5)
5    (14,24,34,44,54)  (26,NULL,NULL,180,24)  ('ij','jk',NULL,'kl','lm')          4        -3        -6  (4,1,-2,-5)

 ************************* DataFrame.tdtypes *********************

id                                   INTEGER()
arr1                   ARRAY_INTEGER('[1:10]')
arr2                   ARRAY_INTEGER('[1:10]')
arr3         ARRAY_VARCHAR('[1:10]', length=4)
start_col                            INTEGER()
step_col                             INTEGER()
stop_col                             INTEGER()
arr_seq                 ARRAY_INTEGER('[100]')